Repository: jenspfahl/BDT
Catalog: lib/l10n/app_*.arb
Languages: de, zh

source: Ok
zh: 确定

source: Cancel
de: Abbrechen
zh: 取消

source: Close
de: Schließen
zh: 关闭

source: Reset
de: Zurücksetzen
zh: 重置

# breakName
source: break
de: Pause
zh: 休息

# batterySavingsHint
source: To schedule accurate alarms, this app should be excluded from all battery optimizations. If the app isn't working correctly, you should do just that. Open Settings and enable the exception ('Not Optimized') for '{appName}'.
de: Um präzise Alarme zu planen, sollte diese App von allen Akkuoptimierungen ausgenommen werden. Funktioniert die App nicht richtig, sollten Sie genau das tun. Öffnen Sie die Einstellungen und aktivieren Sie die Ausnahme ('Nicht optimiert') für '{appName}'.
zh: 为确保闹钟准时提醒，此应用应排除在所有电池优化之外。如果应用无法正常工作，请按此操作：打开“设置”并为“{appName}”启用例外（“未优化”）。

source: Open Settings
de: Einstellungen öffnen
zh: 打开设置

source: Don't ask again
de: Nicht mehr fragen
zh: 不再询问

source: Volume
de: Lautstärke
zh: 音量

source: Mute
de: stummschalten
zh: 静音

source: muted
de: stumm
zh: 已静音

source: Hours
de: Stunden
zh: 小时

source: Minutes
de: Minuten
zh: 分钟

source: Seconds
zh: 秒

source: Change seconds
zh: 更改秒数

source: settings
de: Einstellungen
zh: 设置

source: Common Settings
de: Allgemeine Einstellungen
zh: 通用设置

source: Dark theme
de: Dunkles Design
zh: 深色主题

# useSystemColors
source: Use dynamic system colors
zh: 使用动态系统配色

source: Color scheme
de: Farbschema
zh: 配色方案

# selectColorScheme
source: Change a color scheme
de: Farbschema ändern
zh: 更改配色方案

source: Audio signals
de: Audiosignale
zh: 音频信号

# selectAudioScheme
source: Change audio signal scheme
de: Audiosignal-Schema ändern
zh: 更改音频信号方案

source: Run Settings
de: Lauf-Einstellungen
zh: 运行设置

# notifyUponReachedBreaks
source: Notifies you when breaks are reached
de: Benachrichtigt bei erreichten Pausen
zh: 休息点到达时通知

# notifyUponReachedBreaksDescription
source: Notifies you when a break is reached and a run has started or ended.
de: Benachrichtigt, wenn eine Pause erreicht wird und ein Lauf gestartet oder beendet wurde.
zh: 休息点到达及运行开始或结束时通知。

# vibrateUponReachedBreaks
source: Vibrates when breaks are reached
de: Vibriert bei erreichten Pausen
zh: 休息点到达时振动

# vibrateUponReachedBreaksDescription
source: Vibrates with a pattern when a break is reached and a run has started or ended.
de: Vibriert mit einem Muster, wenn eine Pause erreicht wird und ein Lauf gestartet oder beendet wurde.
zh: 休息点到达及运行开始或结束时按特定模式振动。

# signalTwiceUponReachedBreaks
source: Two signals when breaks are reached
de: Zweimaliges Signal bei erreichten Pausen
zh: 休息点到达时发出两次信号

# signalTwiceUponReachedBreaksDescription
source: To ensure no break is missed, each break is signaled twice.
de: Um keine Pause zu verpassen, wird jede Pause zweimal signalisiert.
zh: 为确保不错过休息，每个休息点都会发出两次信号。

# signalWithoutCounter
source: Signal without counter information
de: Signal ohne Zählerinformation
zh: 没有计数器信息的信号

# signalWithoutCounterDescription
source: Don't encode the counter in the audio and vibration signal.
de: Der Pausenzähler wird nicht im Audio- und Vibrationssignal kodiert.
zh: 音频和振动信号中不包含计数器信息。

# defaultBreakOrder
source: The break order descending by default
de: Die Pausenreihenfolge ist standardmäßig absteigend
zh: 休息点顺序默认为递减

# defaultBreakOrderDescription
source: Instead of 1, 2, 3... the order ..., 3, 2, 1 is used.
de: Anstatt 1, 2, 3 ... wird die Reihenfolge ..., 3, 2, 1 verwendet.
zh: 休息点顺序为 …, 3, 2, 1，而非 1, 2, 3…。

# showRunSpinner
source: Show run indicator
de: Lauf-Indikator anzeigen
zh: 显示运行指示器

# showRunSpinnerDescription
source: Displays a spinning indicator in the timer wheel while the timer is running.
de: Zeigt während der Timer läuft einen rotierenden Indikator im Timer-Rad an.
zh: 定时器运行时，在定时器轮盘中显示旋转指示器。

# showArrowsOnTimeValues
source: Displays arrows at time values
de: Zeigt Pfeile an Zeitwerten an
zh: 在时间值旁显示箭头

# showArrowsOnTimeValuesDescription
source: Displays arrows at values during a timer run to indicate their direction of travel.
de: Zeigt während eines Timer-Laufs Pfeile an Werten an, um deren Laufrichtung zu verdeutlichen.
zh: 在定时器运行时，在时间值旁显示箭头以指示其变化方向。

source: Preset Settings
de: Voreinstellungen
zh: 预设设置

source: Hide predefined presets
de: Vordefinierte Voreinstellungen ausblenden
zh: 隐藏预定义的预设

# hidePredefinedPresetsDescription
source: If you don't need the predefined presets, you can hide them. Only your own custom presets will then be displayed.
de: Wenn Sie die vordefinierten Voreinstellungen nicht benötigen, können Sie diese ausblenden. Es werden dann nur Ihre eigenen erstellten Voreinstellungen angezeigt.
zh: 如果您不需要预定义的预设，可将其隐藏，仅显示您自己的自定义预设。

# customizedPresetsOnTop
source: Show custom presets at the top
de: Benutzerdefinierte Voreinstellungen oben anzeigen
zh: 在顶部显示自定义预设

# customizedPresetsOnTopDescription
source: Custom presets are displayed at the top of the preset list for faster access.
de: Benutzer-Voreinstellungen werden für einen schnelleren Zugriff oben in der Voreinstellungsliste angezeigt.
zh: 自定义预设显示在预设列表顶部以便快速访问。

source: App Behaviour Settings
de: App-Verhaltenseinstellungen
zh: 应用行为设置

source: Activate Wake Lock
de: Aktiviert den Wake-Lock
zh: 激活唤醒锁定

# activateWakeLockDescription
source: A wake lock prevents the screen from turning off automatically.
de: Ein Wake-Lock verhindert, dass sich der Bildschirm automatisch ausschaltet.
zh: 唤醒锁定可防止屏幕自动关闭。

# startAppFromScratch
source: Launch the app with an empty timer wheel
de: App mit leerem Timer-Rad starten
zh: 启动应用时使用空白定时器轮盘

# startAppFromScratchDescription
source: When the app starts, it will launch with an empty timer wheel or your preferred preset. If this option is disabled, the last used state will be restored when the app starts.
de: Wenn die App startet, wird mit leerem Timer-Rad oder mit der präferierten Voreinstellung gestartet. Wenn diese Option deaktiviert ist, wird der zuletzt verwendete Zustand beim Start der App wiederhergestellt.
zh: 应用启动时将使用空白定时器轮盘或首选预设。如果禁用此选项，应用启动时将恢复上次使用状态。

# clockModeAsDefault
source: Use clock mode as default
de: Uhrzeit-Modus als Standard verwenden
zh: 默认使用时钟模式

# clockModeAsDefaultDescription
source: Set clock mode instead of timer mode as default
de: Uhrzeit-Modus anstelle des Timer-Modus als Standard festlegen
zh: 默认设置为时钟模式而非定时器模式

# info
source: Information
de: Informationen
zh: 信息

source: Battery optimizations
de: Akkuoptimierungen
zh: 电池优化

source: About the app
de: Über die App
zh: 关于应用

source: Help
de: Hilfe
zh: 帮助

# visitAppGithubPage
source: Visit {url} to view the code, report bugs, and rate!
de: Besuchen Sie {url}, um den Code anzusehen, Fehler zu melden und Sterne zu vergeben!
zh: 访问 {url} 查看代码、报告错误和评分！

# visitAppHomePage
source: Visit {url} for more information.
de: Besuchen Sie {url} für mehr Information.
zh: 访问 {url} 了解更多信息。

# appShortDescription
source: A timer with intermediate notifications
de: Ein Timer mit Zwischenbenachrichtigungen
zh: 支持中间通知的定时器

# appSummary
source: This timer lets you set any number of intermediate notifications ('breaks') to keep you informed about the progress of the elapsed time.
de: Mit diesem Timer können Sie beliebig viele Zwischen-Benachrichtigungen ('Pausen') einstellen, um über den Fortschritt der verstrichenen Zeit informiert zu werden.
zh: 本定时器支持设置任意数量的中间通知（“休息点”），帮助您掌握时间进度。

# appExplanation
source: Select a duration or time for the timer by clicking the center of the wheel. Select any number of breaks on the timer wheel by clicking a segment. Each break generates a signal (audible and/or vibration) with the following unique patterns (click to play):
de: Wählen Sie eine Dauer oder einen Zeitpunkt für den Timer, indem Sie auf die Mitte des Rades klicken. Wählen Sie beliebige Pausen auf dem Timer-Rad aus, indem Sie auf einen Abschnitt klicken. Jede Pause erzeugt ein Signal (akustisch und/oder Vibration) mit folgenden eindeutigen Mustern (zum Abspielen anklicken):
zh: 点击定时器轮盘中心选择定时器的时长或时间。点击轮盘刻度段可在定时器轮盘上选择任意数量的休息点。每个休息点都会生成信号（声音和/或振动），并对应以下专属模式（点击即可播放）：

# breakReached
source: Break {breakNumber} of {breakCount} reached
de: Pause {breakNumber} von {breakCount} wurde erreicht
zh: 到达第 {breakNumber} 个休息点，共 {breakCount} 个

source: Timer started
de: Timer gestartet
zh: 计时开始

source: Timer finished
de: Timer beendet
zh: 计时结束

# timerFinishedButRepeating
source: Timer finished, but will repeat
de: Timer beendet, wird aber wiederholt
zh: 计时结束，但会重复

source: after {duration}
de: nach {duration}
zh: {duration} 后

# afterXRuns
source: after {runCount} runs
de: nach {runCount} Läufen
zh: {runCount} 次运行后

# withBreaks
source: with {breakCount} breaks
de: mit {breakCount} Pausen
zh: 有 {breakCount} 个休息点

source: Break presets
de: Voreinstellungen für Pausen
zh: 休息点预设

# breakPresetPinned
source: Preset '{preset}' pinned
de: Voreinstellung '{preset}' markiert
zh: 预设“{preset}”已固定

# breakPresetUnpinned
source: Preset '{preset}' unpinned
de: Voreinstellung '{preset}' nicht mehr markiert
zh: 预设“{preset}”已取消固定

# savePresetTitle
source: Save preset
de: Voreinstellung speichern
zh: 保存预设

# savePresetMessage
source: Enter a name for your preset to save.
de: Geben Sie einen Namen für diese Voreinstellung ein.
zh: 输入要保存的预设名称。

# savePresetHint
source: choose a name
de: Wählen Sie einen Namen
zh: 输入名称

# errorSavePresetNameMissing
source: Preset name missing
de: Name der Voreinstellung fehlt
zh: 缺少预设名称

# errorSavePresetNameInUse
source: Preset name still used. Choose another one
de: Dieser Name wird bereits verwendet. Wählen Sie einen anderen.
zh: 预设名称已被使用，请选择其他名称

# savePresetIncludeDuration
source: Include duration
de: Dauer speichern
zh: 包括时长

# savePresetIncludeTime
source: Include time
de: Zeit speichern
zh: 包括时间

# savePresetDone
source: '{preset}' saved
de: '{preset}' gespeichert
zh: “{preset}”已保存

# removePresetTitle
source: Remove saved preset
de: Gespeicherte Voreinstellung entfernen
zh: 移除已保存的预设

# removePresetMessage
source: Are you sure to delete '{preset}' permanently?
de: Möchten Sie '{preset}' endgültig löschen?
zh: 确定要永久删除“{preset}”？

# removePresetDone
source: '{preset}' removed
de: '{preset}' entfernt
zh: “{preset}”已移除

# breakOrderSwitchedToAscending
source: Break order changed to ascending
de: Pausensortierung aufsteigend
zh: 休息点顺序已更改为升序

# breakOrderSwitchedToDescending
source: Break order changed to descending
de: Pausensortierung absteigend
zh: 休息点顺序已更改为降序

# startTimer
source: Start
zh: 开始

# stopTimer
source: Stop
zh: 停止

source: Swipe to Stop
de: Zum Stoppen wischen
zh: 滑动即可停止

source: Repeat once
de: Einmal wiederholen
zh: 单次重复

source: Repeat forever
de: Immer wiederholen
zh: 无限重复

source: No repeat
de: Keine Wiederholung
zh: 不重复

# xBreaksPlaced
source: {breakCount} breaks placed
de: {breakCount} gesetzte Pausen
zh: 已设置 {breakCount} 个休息点

# xBreaksPlacedRepeatOnce
source: {breakCount} breaks placed, repeat once
de: {breakCount} gesetzte Pausen, einmal wiederholen
zh: 已设置 {breakCount} 个休息点，单次重复

# xBreaksPlacedRepeatForever
source: {breakCount} breaks placed, repeat forever
de: {breakCount} gesetzte Pausen, immer wiederholen
zh: 已设置 {breakCount} 个休息点，无限重复

# xBreaksLeft
source: {remainingBreaks} of {breakCount} breaks left
de: {remainingBreaks} von {breakCount} verbleibenden Pausen
zh: 还剩 {remainingBreaks} 个休息点，共 {breakCount} 个

# xBreaksLeftRepeatOnce
source: {remainingBreaks} of {breakCount} breaks left, repeating once (run {runCount} of 2)
de: {remainingBreaks} von {breakCount} verbleibenden Pausen, einmal wiederholen (Lauf {runCount} von 2)
zh: 还剩 {remainingBreaks} 个休息点，共 {breakCount} 个，单次重复（运行 {runCount} 次，共 2 次）

# xBreaksLeftRepeatForever
source: {remainingBreaks} of {breakCount} breaks left, repeating forever (run {runCount})
de: {remainingBreaks} von {breakCount} verbleibenden Pausen, immer wiederholen (Lauf {runCount})
zh: 还剩 {remainingBreaks} 个休息点，共 {breakCount} 个，无限重复（运行 {runCount} 次）

source: Split breaks
zh: 拆分休息点

# splitBreaksDescription
source: Select the number of breaks needed for {duration}.
zh: 选择 {duration} 所需的休息点数量。

# durationBetweenBreaks
source: Duration between {breakCount} breaks: {duration}
zh: {breakCount} 个休息点的间隔时长：{duration}

# errorNoPermissionForNotifications
source: Notifications won't work as long as this permission is not granted.
de: Benachrichtigungen funktionieren nicht, solange diese Berechtigung nicht erteilt wurde.
zh: 未授予此权限，通知将无法正常工作。

# errorDeviceMuted
source: Device is muted. Unmute first to set volume.
de: Das Gerät ist stummgeschaltet. Deaktivieren Sie zuerst die Stummschaltung, um die Lautstärke einzustellen.
zh: 设备已静音。请先取消静音以设置音量。

# errorMaxBreaksReached
source: Maximum {maxBreakCount} breaks allowed
de: Maximal {maxBreakCount} Pausen erlaubt
zh: 最多允许 {maxBreakCount} 个休息点

# errorNoBreaksToReset
source: No breaks to reset
de: Keine Unterbrechungen zum Zurücksetzen
zh: 无休息点可重置

# errorClockTimeToClose
source: The timer-time must be more than one minute in the future.
de: Die Timer-Zeit muss mehr als eine Minute in der Zukunft liegen.
zh: 定时时间必须设置为未来一分钟之后。

# errorDurationIsZero
source: The duration cannot be zero.
de: Die Dauer darf nicht null sein.
zh: 时长不能为零。

# errorTimeAlreadyElapsed
source: The timer-time has already expired; set a new timer.
de: Die Timer-Zeit ist bereits abgelaufen, setze einen neuen Timer.
zh: 定时时间已到，请设置新定时器。
